app/controllers/admins_controller.rb

  def index
    @user = User.new
    authorize @user
    @users = User.all
---
SELECT "users".* FROM "users"