app/controllers/records_controller.rb

  def index
    @records = Record.all
    @q = Record.ransack(params[:q])
    @records = @q.result.order(:dataprotocol).page(params[:page]).per(10)
---
SELECT "records".* FROM "records"
SELECT COUNT(*) FROM "records"

  def create
    @record = Record.new(record_params)

    respond_to do |format|
      if @record.save
---
INSERT INTO "records" ("description", "origin", "topic", "part", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["description", "Qualquer"], ["origin", "Qualquer"], ["topic", "Qualquer"], ["part", "Fulano"], ["created_at", "2017-11-29 19:40:43.184231"], ["updated_at", "2017-11-29 19:40:43.184231"]]

  def update
    respond_to do |format|
      if @record.update(record_params)
---
UPDATE "records" SET "origin" = ?, "topic" = ?, "part" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["origin", "EDITADO"], ["topic", "EDITADO"], ["part", "EDITADO"], ["updated_at", "2018-01-24 14:51:45.964083"], ["id", 8]]

  def destroy

    @user = User.new
    authorize @user
    @record.destroy
---
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 1]]